---
kind: type
id: T:Autodesk.Revit.DB.CurtainGrid
source: html/5e0d5b7c-aaa1-d299-6fb8-2faa65b1857a.htm
---
# Autodesk.Revit.DB.CurtainGrid

Represents a curtain grid element within Autodesk Revit.

## Syntax (C#)
```csharp
public class CurtainGrid : APIObject
```

## Remarks
This element is obtained from a curtain wall, curtain system, or curtain roof.
A curtain wall has only one curtain grid, while a curtain system or curtain roof may have several curtain grids.